controllers/SiteController.php

    public function actionLoadimage()
    {
		$model = \app\models\Organization::find()->asArray()->all();
---
SELECT * FROM `organization`