modules/business/controllers/TripsController.php

SELECT * FROM `bur_trips` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Trips::findOne($id)) !== null) {