modules/business/controllers/VehicleController.php

INSERT INTO `bur_vehicle_details` (`name`, `type`, `vehicle_number`, `size`, `status`) VALUES ('fghfghfgh', 1, 'ffghgfh456', 'fghfgh,56756756', '1')
---
    public function actionCreate()
    {
        $model = new VehicleDetails();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `bur_vehicle_details` WHERE `id`='3'
---
    protected function findModel($id)
    {
        if (($model = VehicleDetails::findOne($id)) !== null) {