modules/business/views/trips/index.php

	'label'=>'Customer',
    'attribute'=>"buyer",
    'value' => 'buyers.name',
	'filter' => ArrayHelper::map(app\modules\business\models\CustomerDetails::find()->where(['customer_type'=>2])->all(), 'id', 'name')
---
SELECT * FROM `bur_customer_details` WHERE `customer_type`=2

	 ['label'=>'Vehicle',
            'attribute'=>"vehicle_id",
            'value' => 'vehicles.name',
	   'filter' => ArrayHelper::map(app\modules\business\models\VehicleDetails::find()->all(), 'id', 'name')
---
SELECT * FROM `bur_vehicle_details`

	  ['label'=>'Driver',
	    'attribute'=>"driver_id",
	    'value' => 'driver.name',
	    'filter' => ArrayHelper::map(app\modules\business\models\CustomerDetails::find()->where(['customer_type'=>3])->all(), 'id', 'name')
---
SELECT * FROM `bur_customer_details` WHERE `customer_type`=3

	    'label'=>'Material',
	    'attribute'=>"material_id",
	    'value' => 'material.name',
	    'filter' => ArrayHelper::map(app\modules\business\models\MaterialTypes::find()->all(), 'id', 'name')
---
SELECT * FROM `bur_material_types`