modules/business/views/trips/print.php

<body>

<div id="pcr">
<?php $orgData = \app\models\Organization::find()->asArray()->one(); ?>
---
SELECT * FROM `organization`