modules/business/views/driver/_form.php

   <div class="col-xs-12 col-lg-12 no-padding">
    <div class="col-xs-12 col-sm-6 col-lg-6">
    <?php
    echo $form->field($model, 'vehicle')->widget(Select2::classname(), [
    'data' => ArrayHelper::map(VehicleDetails::find()->select(['id','concat(name," - ",vehicle_number) as name'])->where(['status'=>1])->orderBy('name')->all(), 'id', 'name'),
    'options' => ['placeholder' => 'Select Vehicle ...','style'=>'width:400px','id'=>'vehicle-id'],
    'pluginOptions' => [
    'allowClear' => true
    ],
    ]);
---
SELECT `id`, concat(name," - ",vehicle_number) as name FROM `bur_vehicle_details` WHERE `status`=1 ORDER BY `name`