modules/business/views/driver/index.php

SELECT * FROM `bur_vehicle_details` WHERE `id`=2
SELECT * FROM `bur_vehicle_details`
---
            'name',
            'place',
            //'address:ntext',
		    [
				'label' => 'Vehice',
				'attribute' => 'vehicle',
				'value' => 'driverVehicle.name',
				'filter' => ArrayHelper::map(app\modules\business\models\VehicleDetails::find()->all(), 'id', 'name')
		    ],